app/views/users/show.html.erb

        <ul class="user_page-contents">
          <%  current_user.reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 4